<?xml version="1.0" ?>
<net name="litehrnet_18_coco_384x288" version="10">
	<layers>
		<layer id="0" name="input.1" type="Parameter" version="opset1">
			<data shape="1, 3, 384, 288" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="input.1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>384</dim>
					<dim>288</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="5924" type="Const" version="opset1">
			<data element_type="f16" shape="32, 3, 3, 3" offset="0" size="1728"/>
			<output>
				<port id="0" precision="FP16" names="5924">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Conv_0/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>384</dim>
					<dim>288</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>144</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Conv_0/Dims30844" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="1728" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Conv_0" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>144</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="5923">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>144</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Relu_1" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>144</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="1421">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>144</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="40252129883" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1792" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="7" name="40254127876" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="1800" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Slice_12/Split" type="VariadicSplit" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>144</dim>
				</port>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16" names="1432">
					<dim>1</dim>
					<dim>16</dim>
					<dim>192</dim>
					<dim>144</dim>
				</port>
				<port id="4" precision="FP16" names="1435">
					<dim>1</dim>
					<dim>16</dim>
					<dim>192</dim>
					<dim>144</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="5936" type="Const" version="opset1">
			<data element_type="f16" shape="16, 1, 1, 3, 3" offset="1816" size="288"/>
			<output>
				<port id="0" precision="FP16" names="5936">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Conv_21/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>192</dim>
					<dim>144</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Conv_21/Dims29860" type="Const" version="opset1">
			<data element_type="f16" shape="1, 16, 1, 1" offset="2104" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Conv_21" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="5935">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="5939" type="Const" version="opset1">
			<data element_type="f16" shape="16, 16, 1, 1" offset="2136" size="512"/>
			<output>
				<port id="0" precision="FP16" names="5939">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Conv_22/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Conv_22/Dims31216" type="Const" version="opset1">
			<data element_type="f16" shape="1, 16, 1, 1" offset="2648" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Conv_22" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="5938">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Relu_23" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="1448">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="5927" type="Const" version="opset1">
			<data element_type="f16" shape="32, 16, 1, 1" offset="2680" size="1024"/>
			<output>
				<port id="0" precision="FP16" names="5927">
					<dim>32</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Conv_16/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>192</dim>
					<dim>144</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>144</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Conv_16/Dims30334" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="3704" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Conv_16" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>144</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="5926">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>144</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Relu_17" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>144</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="1438">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>144</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="5930" type="Const" version="opset1">
			<data element_type="f16" shape="32, 1, 1, 3, 3" offset="3768" size="576"/>
			<output>
				<port id="0" precision="FP16" names="5930">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Conv_18/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>144</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Conv_18/Dims30802" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="4344" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Conv_18" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="5929">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="5933" type="Const" version="opset1">
			<data element_type="f16" shape="16, 32, 1, 1" offset="4408" size="1024"/>
			<output>
				<port id="0" precision="FP16" names="5933">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Conv_19/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Conv_19/Dims30640" type="Const" version="opset1">
			<data element_type="f16" shape="1, 16, 1, 1" offset="5432" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Conv_19" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="5932">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Relu_20" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="1443">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Concat_24" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="1449">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="6696" type="Const" version="opset1">
			<data element_type="i64" shape="5" offset="5464" size="40"/>
			<output>
				<port id="0" precision="I64" names="6696">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Reshape_25" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="1461">
					<dim>1</dim>
					<dim>2</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="2099" type="Const" version="opset1">
			<data element_type="i64" shape="5" offset="5504" size="40"/>
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Transpose_26" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>2</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="1462">
					<dim>1</dim>
					<dim>16</dim>
					<dim>2</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="6701130525" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="5544" size="32"/>
			<output>
				<port id="0" precision="I64" names="6701">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Reshape_27" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>2</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="1469">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="5942" type="Const" version="opset1">
			<data element_type="f16" shape="32, 1, 1, 3, 3" offset="5576" size="576"/>
			<output>
				<port id="0" precision="FP16" names="5942">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Conv_28/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Conv_28/Dims30358" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="6152" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Conv_28" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="5941">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="5945" type="Const" version="opset1">
			<data element_type="f16" shape="40, 32, 1, 1" offset="6216" size="2560"/>
			<output>
				<port id="0" precision="FP16" names="5945">
					<dim>40</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Conv_29/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>40</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>40</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Conv_29/Dims31666" type="Const" version="opset1">
			<data element_type="f16" shape="1, 40, 1, 1" offset="8776" size="80"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Conv_29" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>40</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="5944">
					<dim>1</dim>
					<dim>40</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Relu_30" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>40</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="1474">
					<dim>1</dim>
					<dim>40</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="40257131008" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1792" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="49" name="40259131335" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="8856" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Slice_44/Split" type="VariadicSplit" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>40</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16" names="1490">
					<dim>1</dim>
					<dim>20</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
				<port id="4" precision="FP16" names="1493">
					<dim>1</dim>
					<dim>20</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="AveragePool_64" type="AvgPool" version="opset1">
			<data kernel="2, 2" strides="2, 2" pads_begin="0, 0" pads_end="0, 0" exclude-pad="true" auto_pad="explicit" rounding_type="floor"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>20</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="1510">
					<dim>1</dim>
					<dim>20</dim>
					<dim>48</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="5948" type="Const" version="opset1">
			<data element_type="f16" shape="32, 1, 1, 3, 3" offset="8872" size="576"/>
			<output>
				<port id="0" precision="FP16" names="5948">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Conv_31/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Conv_31/Dims30934" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="9448" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Conv_31" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="5947">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="5951" type="Const" version="opset1">
			<data element_type="f16" shape="80, 32, 1, 1" offset="9512" size="5120"/>
			<output>
				<port id="0" precision="FP16" names="5951">
					<dim>80</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Conv_32/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>80</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>80</dim>
					<dim>48</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Conv_32/Dims30052" type="Const" version="opset1">
			<data element_type="f16" shape="1, 80, 1, 1" offset="14632" size="160"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Conv_32" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>80</dim>
					<dim>48</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="5950">
					<dim>1</dim>
					<dim>80</dim>
					<dim>48</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Relu_33" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>80</dim>
					<dim>48</dim>
					<dim>36</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="1479">
					<dim>1</dim>
					<dim>80</dim>
					<dim>48</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="40262128932" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1792" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="62" name="40264127114" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="14792" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Slice_58/Split" type="VariadicSplit" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>80</dim>
					<dim>48</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16" names="1504">
					<dim>1</dim>
					<dim>40</dim>
					<dim>48</dim>
					<dim>36</dim>
				</port>
				<port id="4" precision="FP16" names="1507">
					<dim>1</dim>
					<dim>40</dim>
					<dim>48</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Concat_65" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>20</dim>
					<dim>48</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>40</dim>
					<dim>48</dim>
					<dim>36</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="1511">
					<dim>1</dim>
					<dim>60</dim>
					<dim>48</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="5954" type="Const" version="opset1">
			<data element_type="f16" shape="7, 60, 1, 1" offset="14808" size="840"/>
			<output>
				<port id="0" precision="FP16" names="5954">
					<dim>7</dim>
					<dim>60</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Conv_66/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>48</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>7</dim>
					<dim>60</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>7</dim>
					<dim>48</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Conv_66/Dims30622" type="Const" version="opset1">
			<data element_type="f16" shape="1, 7, 1, 1" offset="15648" size="14"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>7</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Conv_66" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>7</dim>
					<dim>48</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>7</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="5953">
					<dim>1</dim>
					<dim>7</dim>
					<dim>48</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Relu_67" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>7</dim>
					<dim>48</dim>
					<dim>36</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="1514">
					<dim>1</dim>
					<dim>7</dim>
					<dim>48</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="5957" type="Const" version="opset1">
			<data element_type="f16" shape="60, 7, 1, 1" offset="15662" size="840"/>
			<output>
				<port id="0" precision="FP16" names="5957">
					<dim>60</dim>
					<dim>7</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Conv_68/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>7</dim>
					<dim>48</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>60</dim>
					<dim>7</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>48</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Conv_68/Dims31330" type="Const" version="opset1">
			<data element_type="f16" shape="1, 60, 1, 1" offset="16502" size="120"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Conv_68" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>48</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="5956">
					<dim>1</dim>
					<dim>60</dim>
					<dim>48</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Sigmoid_69" type="Sigmoid" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>48</dim>
					<dim>36</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="1517">
					<dim>1</dim>
					<dim>60</dim>
					<dim>48</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Split_70/VariadicSplit_input_port_1/value" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1792" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="76" name="Split_70/VariadicSplit_input_port_2/value" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="16622" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Split_70/VariadicSplit" type="VariadicSplit" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>48</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16" names="1518">
					<dim>1</dim>
					<dim>20</dim>
					<dim>48</dim>
					<dim>36</dim>
				</port>
				<port id="4" precision="FP16" names="1519">
					<dim>1</dim>
					<dim>40</dim>
					<dim>48</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Resize_79/StridedSlice_sizes21633128539" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="16638" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="2162521627129463" type="Const" version="opset1">
			<data element_type="f32" shape="4" offset="16654" size="16"/>
			<output>
				<port id="0" precision="FP32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Resize_79/ShapeOf" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>20</dim>
					<dim>48</dim>
					<dim>36</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="21624" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Resize_79/Div" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Resize_79/Add_input_port_1/value21623130690" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="16670" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Resize_79/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Resize_79/StridedSlice_scales_input_port_1/value21612129949" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="16674" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Resize_79/StridedSlice_scales_input_port_2/value21614131638" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="16682" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Resize_79/StridedSlice_scales_input_port_3/value21616131620" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1792" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Resize_79/StridedSlice_scales" type="StridedSlice" version="opset1">
			<data begin_mask="0" end_mask="0" new_axis_mask="0" shrink_axis_mask="0" ellipsis_mask="0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Resize_79/axis21619130630" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="16690" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Resize_79" type="Interpolate" version="opset4">
			<data mode="nearest" shape_calculation_mode="sizes" coordinate_transformation_mode="asymmetric" nearest_mode="floor" antialias="false" pads_begin="0, 0, 0, 0" pads_end="0, 0, 0, 0" cube_coeff="-0.75"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>20</dim>
					<dim>48</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>2</dim>
				</port>
				<port id="3" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP16" names="1534">
					<dim>1</dim>
					<dim>20</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Mul_80" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>20</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>20</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="1535">
					<dim>1</dim>
					<dim>20</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="5960" type="Const" version="opset1">
			<data element_type="f16" shape="20, 1, 1, 3, 3" offset="16706" size="360"/>
			<output>
				<port id="0" precision="FP16" names="5960">
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Conv_91/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>20</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>20</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Conv_91/Dims31468" type="Const" version="opset1">
			<data element_type="f16" shape="1, 20, 1, 1" offset="17066" size="40"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Conv_91" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>20</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="5959">
					<dim>1</dim>
					<dim>20</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="2104" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="16674" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="97" name="GlobalAveragePool_93/input_rank/shape_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>20</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="GlobalAveragePool_93/input_rank/rank_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="GlobalAveragePool_93/input_rank/0d_rank_of/value" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="17106" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="GlobalAveragePool_93/input_rank" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64"/>
			</output>
		</layer>
		<layer id="101" name="2106" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1792" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="102" name="GlobalAveragePool_93/global_pooling_reduce_axis" type="Range" version="opset4">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="GlobalAveragePool_93/reduce" type="ReduceMean" version="opset1">
			<data keep_dims="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>20</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="1556">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="backbone.stage0.0.layers.0.spatial_weighting.0.conv1.conv.weight" type="Const" version="opset1">
			<data element_type="f16" shape="5, 20, 1, 1" offset="17114" size="200"/>
			<output>
				<port id="0" precision="FP16" names="backbone.stage0.0.layers.0.spatial_weighting.0.conv1.conv.weight">
					<dim>5</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Conv_94/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>5</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>5</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Conv_94/Dims29968" type="Const" version="opset1">
			<data element_type="f16" shape="1, 5, 1, 1" offset="17314" size="10"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>5</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="Conv_94" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>5</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>5</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="1557">
					<dim>1</dim>
					<dim>5</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="Relu_95" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>5</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="1558">
					<dim>1</dim>
					<dim>5</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="backbone.stage0.0.layers.0.spatial_weighting.0.conv2.conv.weight" type="Const" version="opset1">
			<data element_type="f16" shape="20, 5, 1, 1" offset="17324" size="200"/>
			<output>
				<port id="0" precision="FP16" names="backbone.stage0.0.layers.0.spatial_weighting.0.conv2.conv.weight">
					<dim>20</dim>
					<dim>5</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Conv_96/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>5</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>20</dim>
					<dim>5</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Conv_96/Dims31486" type="Const" version="opset1">
			<data element_type="f16" shape="1, 20, 1, 1" offset="17524" size="40"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="Conv_96" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="1559">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Sigmoid_97" type="Sigmoid" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="1560">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="Mul_98" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>20</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="1561">
					<dim>1</dim>
					<dim>20</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="Concat_105" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>20</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>20</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="1568">
					<dim>1</dim>
					<dim>40</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="6715" type="Const" version="opset1">
			<data element_type="i64" shape="5" offset="17564" size="40"/>
			<output>
				<port id="0" precision="I64" names="6715">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="Reshape_107" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>40</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="1581">
					<dim>1</dim>
					<dim>2</dim>
					<dim>20</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="2095" type="Const" version="opset1">
			<data element_type="i64" shape="5" offset="5504" size="40"/>
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="Transpose_108" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>2</dim>
					<dim>20</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="1582">
					<dim>1</dim>
					<dim>20</dim>
					<dim>2</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="6701" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="5544" size="32"/>
			<output>
				<port id="0" precision="I64" names="6701">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="Reshape_109" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>20</dim>
					<dim>2</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="1589">
					<dim>1</dim>
					<dim>40</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="40267127189" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1792" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="123" name="40269129496" type="Const" version="opset1">
