<?xml version="1.0" ?>
<net name="litehrnet_30_coco_384x288" version="10">
	<layers>
		<layer id="0" name="input.1" type="Parameter" version="opset1">
			<data shape="1, 3, 384, 288" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="input.1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>384</dim>
					<dim>288</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="10164" type="Const" version="opset1">
			<data element_type="f32" shape="32, 3, 3, 3" offset="0" size="3456"/>
			<output>
				<port id="0" precision="FP32" names="10164">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Conv_0/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>384</dim>
					<dim>288</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>144</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Conv_0/Dims53245" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="3456" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Conv_0" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>144</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="10163">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>144</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Relu_1" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>144</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="2363">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>144</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="68979223345" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="3584" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="7" name="68981221728" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="3592" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Slice_12/Split" type="VariadicSplit" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>144</dim>
				</port>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="2374">
					<dim>1</dim>
					<dim>16</dim>
					<dim>192</dim>
					<dim>144</dim>
				</port>
				<port id="4" precision="FP32" names="2377">
					<dim>1</dim>
					<dim>16</dim>
					<dim>192</dim>
					<dim>144</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="10176" type="Const" version="opset1">
			<data element_type="f32" shape="16, 1, 1, 3, 3" offset="3608" size="576"/>
			<output>
				<port id="0" precision="FP32" names="10176">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Conv_21/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>192</dim>
					<dim>144</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Conv_21/Dims54427" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="4184" size="64"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Conv_21" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="10175">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="10179" type="Const" version="opset1">
			<data element_type="f32" shape="16, 16, 1, 1" offset="4248" size="1024"/>
			<output>
				<port id="0" precision="FP32" names="10179">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Conv_22/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Conv_22/Dims53341" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="5272" size="64"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Conv_22" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="10178">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Relu_23" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="2390">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="10167" type="Const" version="opset1">
			<data element_type="f32" shape="32, 16, 1, 1" offset="5336" size="2048"/>
			<output>
				<port id="0" precision="FP32" names="10167">
					<dim>32</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Conv_16/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>192</dim>
					<dim>144</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>144</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Conv_16/Dims52621" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="7384" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Conv_16" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>144</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="10166">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>144</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Relu_17" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>144</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="2380">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>144</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="10170" type="Const" version="opset1">
			<data element_type="f32" shape="32, 1, 1, 3, 3" offset="7512" size="1152"/>
			<output>
				<port id="0" precision="FP32" names="10170">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Conv_18/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>144</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Conv_18/Dims51877" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="8664" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Conv_18" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="10169">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="10173" type="Const" version="opset1">
			<data element_type="f32" shape="16, 32, 1, 1" offset="8792" size="2048"/>
			<output>
				<port id="0" precision="FP32" names="10173">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Conv_19/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Conv_19/Dims51919" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="10840" size="64"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Conv_19" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="10172">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Relu_20" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="2385">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Concat_24" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="2391">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="11449" type="Const" version="opset1">
			<data element_type="i64" shape="5" offset="10904" size="40"/>
			<output>
				<port id="0" precision="I64" names="11449">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Reshape_25" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="2403">
					<dim>1</dim>
					<dim>2</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="3558" type="Const" version="opset1">
			<data element_type="i64" shape="5" offset="10944" size="40"/>
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Transpose_26" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="2404">
					<dim>1</dim>
					<dim>16</dim>
					<dim>2</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="11454223774" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="10984" size="32"/>
			<output>
				<port id="0" precision="I64" names="11454">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Reshape_27" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>2</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="2411">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="10182" type="Const" version="opset1">
			<data element_type="f32" shape="32, 1, 1, 3, 3" offset="11016" size="1152"/>
			<output>
				<port id="0" precision="FP32" names="10182">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Conv_28/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Conv_28/Dims51655" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="12168" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Conv_28" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="10181">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="10185" type="Const" version="opset1">
			<data element_type="f32" shape="40, 32, 1, 1" offset="12296" size="5120"/>
			<output>
				<port id="0" precision="FP32" names="10185">
					<dim>40</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Conv_29/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>40</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>40</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Conv_29/Dims52105" type="Const" version="opset1">
			<data element_type="f32" shape="1, 40, 1, 1" offset="17416" size="160"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Conv_29" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>40</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="10184">
					<dim>1</dim>
					<dim>40</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Relu_30" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>40</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="2416">
					<dim>1</dim>
					<dim>40</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="68984223351" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="3584" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="49" name="68986224539" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="17576" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Slice_44/Split" type="VariadicSplit" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>40</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="2432">
					<dim>1</dim>
					<dim>20</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
				<port id="4" precision="FP32" names="2435">
					<dim>1</dim>
					<dim>20</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="AveragePool_64" type="AvgPool" version="opset1">
			<data kernel="2, 2" strides="2, 2" pads_begin="0, 0" pads_end="0, 0" exclude-pad="true" auto_pad="explicit" rounding_type="floor"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="2452">
					<dim>1</dim>
					<dim>20</dim>
					<dim>48</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="10188" type="Const" version="opset1">
			<data element_type="f32" shape="32, 1, 1, 3, 3" offset="17592" size="1152"/>
			<output>
				<port id="0" precision="FP32" names="10188">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Conv_31/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Conv_31/Dims51085" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="18744" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Conv_31" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="10187">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="10191" type="Const" version="opset1">
			<data element_type="f32" shape="80, 32, 1, 1" offset="18872" size="10240"/>
			<output>
				<port id="0" precision="FP32" names="10191">
					<dim>80</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Conv_32/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>80</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>80</dim>
					<dim>48</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Conv_32/Dims53275" type="Const" version="opset1">
			<data element_type="f32" shape="1, 80, 1, 1" offset="29112" size="320"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Conv_32" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>80</dim>
					<dim>48</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="10190">
					<dim>1</dim>
					<dim>80</dim>
					<dim>48</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Relu_33" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>80</dim>
					<dim>48</dim>
					<dim>36</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="2421">
					<dim>1</dim>
					<dim>80</dim>
					<dim>48</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="68989221044" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="3584" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="62" name="68991219724" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="29432" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Slice_58/Split" type="VariadicSplit" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>80</dim>
					<dim>48</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="2446">
					<dim>1</dim>
					<dim>40</dim>
					<dim>48</dim>
					<dim>36</dim>
				</port>
				<port id="4" precision="FP32" names="2449">
					<dim>1</dim>
					<dim>40</dim>
					<dim>48</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Concat_65" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>48</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>40</dim>
					<dim>48</dim>
					<dim>36</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="2453">
					<dim>1</dim>
					<dim>60</dim>
					<dim>48</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="10194" type="Const" version="opset1">
			<data element_type="f32" shape="7, 60, 1, 1" offset="29448" size="1680"/>
			<output>
				<port id="0" precision="FP32" names="10194">
					<dim>7</dim>
					<dim>60</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Conv_66/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>60</dim>
					<dim>48</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>7</dim>
					<dim>60</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
					<dim>48</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Conv_66/Dims53851" type="Const" version="opset1">
			<data element_type="f32" shape="1, 7, 1, 1" offset="31128" size="28"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Conv_66" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
					<dim>48</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="10193">
					<dim>1</dim>
					<dim>7</dim>
					<dim>48</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Relu_67" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
					<dim>48</dim>
					<dim>36</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="2456">
					<dim>1</dim>
					<dim>7</dim>
					<dim>48</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="10197" type="Const" version="opset1">
			<data element_type="f32" shape="60, 7, 1, 1" offset="31156" size="1680"/>
			<output>
				<port id="0" precision="FP32" names="10197">
					<dim>60</dim>
					<dim>7</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Conv_68/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
					<dim>48</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>60</dim>
					<dim>7</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>60</dim>
					<dim>48</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Conv_68/Dims53677" type="Const" version="opset1">
			<data element_type="f32" shape="1, 60, 1, 1" offset="32836" size="240"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>60</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Conv_68" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>60</dim>
					<dim>48</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>60</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="10196">
					<dim>1</dim>
					<dim>60</dim>
					<dim>48</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Sigmoid_69" type="Sigmoid" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>60</dim>
					<dim>48</dim>
					<dim>36</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="2459">
					<dim>1</dim>
					<dim>60</dim>
					<dim>48</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Split_70/VariadicSplit_input_port_1/value" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="3584" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="76" name="Split_70/VariadicSplit_input_port_2/value" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="33076" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Split_70/VariadicSplit" type="VariadicSplit" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>60</dim>
					<dim>48</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="2460">
					<dim>1</dim>
					<dim>20</dim>
					<dim>48</dim>
					<dim>36</dim>
				</port>
				<port id="4" precision="FP32" names="2461">
					<dim>1</dim>
					<dim>40</dim>
					<dim>48</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Resize_79/StridedSlice_sizes37013218398" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="33092" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="3700537007217876" type="Const" version="opset1">
			<data element_type="f32" shape="4" offset="33108" size="16"/>
			<output>
				<port id="0" precision="FP32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Resize_79/ShapeOf" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>48</dim>
					<dim>36</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="37004" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Resize_79/Div" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Resize_79/Add_input_port_1/value37003225064" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="33124" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Resize_79/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Resize_79/StridedSlice_scales_input_port_1/value36992220228" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="33128" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Resize_79/StridedSlice_scales_input_port_2/value36994225226" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="33136" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Resize_79/StridedSlice_scales_input_port_3/value36996219670" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="3584" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Resize_79/StridedSlice_scales" type="StridedSlice" version="opset1">
			<data begin_mask="0" end_mask="0" new_axis_mask="0" shrink_axis_mask="0" ellipsis_mask="0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Resize_79/axis36999220264" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="33144" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Resize_79" type="Interpolate" version="opset4">
			<data mode="nearest" shape_calculation_mode="sizes" coordinate_transformation_mode="asymmetric" nearest_mode="floor" antialias="false" pads_begin="0, 0, 0, 0" pads_end="0, 0, 0, 0" cube_coeff="-0.75"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>48</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>2</dim>
				</port>
				<port id="3" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32" names="2476">
					<dim>1</dim>
					<dim>20</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Mul_80" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="2477">
					<dim>1</dim>
					<dim>20</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="10200" type="Const" version="opset1">
			<data element_type="f32" shape="20, 1, 1, 3, 3" offset="33160" size="720"/>
			<output>
				<port id="0" precision="FP32" names="10200">
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Conv_91/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Conv_91/Dims51127" type="Const" version="opset1">
			<data element_type="f32" shape="1, 20, 1, 1" offset="33880" size="80"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Conv_91" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="10199">
					<dim>1</dim>
					<dim>20</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="3585" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="33128" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="97" name="GlobalAveragePool_93/input_rank/shape_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="GlobalAveragePool_93/input_rank/rank_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="GlobalAveragePool_93/input_rank/0d_rank_of/value" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="33960" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="GlobalAveragePool_93/input_rank" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64"/>
			</output>
		</layer>
		<layer id="101" name="3587" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="3584" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="102" name="GlobalAveragePool_93/global_pooling_reduce_axis" type="Range" version="opset4">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="GlobalAveragePool_93/reduce" type="ReduceMean" version="opset1">
			<data keep_dims="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="2498">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="backbone.stage0.0.layers.0.spatial_weighting.0.conv1.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="5, 20, 1, 1" offset="33968" size="400"/>
			<output>
				<port id="0" precision="FP32" names="backbone.stage0.0.layers.0.spatial_weighting.0.conv1.conv.weight">
					<dim>5</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Conv_94/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>5</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>5</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Conv_94/Dims54277" type="Const" version="opset1">
			<data element_type="f32" shape="1, 5, 1, 1" offset="34368" size="20"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>5</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="Conv_94" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>5</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>5</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="2499">
					<dim>1</dim>
					<dim>5</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="Relu_95" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>5</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="2500">
					<dim>1</dim>
					<dim>5</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="backbone.stage0.0.layers.0.spatial_weighting.0.conv2.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="20, 5, 1, 1" offset="34388" size="400"/>
			<output>
				<port id="0" precision="FP32" names="backbone.stage0.0.layers.0.spatial_weighting.0.conv2.conv.weight">
					<dim>20</dim>
					<dim>5</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Conv_96/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>5</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>20</dim>
					<dim>5</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Conv_96/Dims53287" type="Const" version="opset1">
			<data element_type="f32" shape="1, 20, 1, 1" offset="34788" size="80"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="Conv_96" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="2501">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Sigmoid_97" type="Sigmoid" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="2502">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="Mul_98" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="2503">
					<dim>1</dim>
					<dim>20</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="Concat_105" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="2510">
					<dim>1</dim>
					<dim>40</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="11468219085" type="Const" version="opset1">
			<data element_type="i64" shape="5" offset="34868" size="40"/>
			<output>
				<port id="0" precision="I64" names="11468">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="Reshape_107" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>40</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="2523">
					<dim>1</dim>
					<dim>2</dim>
					<dim>20</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="3570" type="Const" version="opset1">
			<data element_type="i64" shape="5" offset="10944" size="40"/>
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="Transpose_108" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>20</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="2524">
					<dim>1</dim>
					<dim>20</dim>
					<dim>2</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="11454" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="10984" size="32"/>
			<output>
				<port id="0" precision="I64" names="11454">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="Reshape_109" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>2</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="2531">
					<dim>1</dim>
					<dim>40</dim>
					<dim>96</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="68994217783" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="3584" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
